/*
 * jvips, a Java implementation that interfaces to libvips
 *
 * Copyright (C) 2023 Jonathan Strauss
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2.1 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * https://www.gnu.org/licenses/old-licenses/lgpl-2.1-standalone.html
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA
 */

// Generated by jextract

package org.libvips;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class _VipsImage {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    Constants$root.C_POINTER$LAYOUT.withName("g_class")
                ).withName("g_type_instance"),
                Constants$root.C_INT$LAYOUT.withName("ref_count"),
                MemoryLayout.paddingLayout(32),
                Constants$root.C_POINTER$LAYOUT.withName("qdata")
            ).withName("parent_instance"),
            Constants$root.C_INT$LAYOUT.withName("constructed"),
            Constants$root.C_INT$LAYOUT.withName("static_object"),
            Constants$root.C_POINTER$LAYOUT.withName("argument_table"),
            Constants$root.C_POINTER$LAYOUT.withName("nickname"),
            Constants$root.C_POINTER$LAYOUT.withName("description"),
            Constants$root.C_INT$LAYOUT.withName("preclose"),
            Constants$root.C_INT$LAYOUT.withName("close"),
            Constants$root.C_INT$LAYOUT.withName("postclose"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("local_memory")
        ).withName("parent_instance"),
        Constants$root.C_INT$LAYOUT.withName("Xsize"),
        Constants$root.C_INT$LAYOUT.withName("Ysize"),
        Constants$root.C_INT$LAYOUT.withName("Bands"),
        Constants$root.C_INT$LAYOUT.withName("BandFmt"),
        Constants$root.C_INT$LAYOUT.withName("Coding"),
        Constants$root.C_INT$LAYOUT.withName("Type"),
        Constants$root.C_DOUBLE$LAYOUT.withName("Xres"),
        Constants$root.C_DOUBLE$LAYOUT.withName("Yres"),
        Constants$root.C_INT$LAYOUT.withName("Xoffset"),
        Constants$root.C_INT$LAYOUT.withName("Yoffset"),
        Constants$root.C_INT$LAYOUT.withName("Length"),
        Constants$root.C_SHORT$LAYOUT.withName("Compression"),
        Constants$root.C_SHORT$LAYOUT.withName("Level"),
        Constants$root.C_INT$LAYOUT.withName("Bbits"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("time"),
        Constants$root.C_POINTER$LAYOUT.withName("Hist"),
        Constants$root.C_POINTER$LAYOUT.withName("filename"),
        Constants$root.C_POINTER$LAYOUT.withName("data"),
        Constants$root.C_INT$LAYOUT.withName("kill"),
        Constants$root.C_FLOAT$LAYOUT.withName("Xres_float"),
        Constants$root.C_FLOAT$LAYOUT.withName("Yres_float"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("mode"),
        Constants$root.C_INT$LAYOUT.withName("dtype"),
        Constants$root.C_INT$LAYOUT.withName("fd"),
        Constants$root.C_POINTER$LAYOUT.withName("baseaddr"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("length"),
        Constants$root.C_INT$LAYOUT.withName("magic"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("start_fn"),
        Constants$root.C_POINTER$LAYOUT.withName("generate_fn"),
        Constants$root.C_POINTER$LAYOUT.withName("stop_fn"),
        Constants$root.C_POINTER$LAYOUT.withName("client1"),
        Constants$root.C_POINTER$LAYOUT.withName("client2"),
        Constants$root.C_POINTER$LAYOUT.withName("sslock"),
        Constants$root.C_POINTER$LAYOUT.withName("regions"),
        Constants$root.C_INT$LAYOUT.withName("dhint"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("meta"),
        Constants$root.C_POINTER$LAYOUT.withName("meta_traverse"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("sizeof_header"),
        Constants$root.C_POINTER$LAYOUT.withName("windows"),
        Constants$root.C_POINTER$LAYOUT.withName("upstream"),
        Constants$root.C_POINTER$LAYOUT.withName("downstream"),
        Constants$root.C_INT$LAYOUT.withName("serial"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("history_list"),
        Constants$root.C_POINTER$LAYOUT.withName("progress_signal"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("file_length"),
        Constants$root.C_INT$LAYOUT.withName("hint_set"),
        Constants$root.C_INT$LAYOUT.withName("delete_on_close"),
        Constants$root.C_POINTER$LAYOUT.withName("delete_on_close_filename")
    ).withName("_VipsImage");
    public static MemoryLayout $LAYOUT() {
        return _VipsImage.$struct$LAYOUT;
    }
    public static MemorySegment parent_instance$slice(MemorySegment seg) {
        return seg.asSlice(0, 80);
    }
    static final VarHandle Xsize$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("Xsize"));
    public static VarHandle Xsize$VH() {
        return _VipsImage.Xsize$VH;
    }
    public static int Xsize$get(MemorySegment seg) {
        return (int)_VipsImage.Xsize$VH.get(seg);
    }
